# Задача 16: Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих 
# строках записаны N целых чисел Ai
# . Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3
# -> 1
# import random 

# def create_random_list(total):
#     array = [random.randint(1,10) for i in range (total)]
#     return array

# n = int(input('Введите размер списка: '))
# array = create_random_list(n)

# print(array)


# from random import randint 
# n = int(input("Введите число: "))
# my_list = [randint(0,10) for _ in range(n)]
# print(my_list)
